import pyautogui
import time

time.sleep(7)

# 使用方法 選取想測試的數據 然後ctrl+？轉回代碼 切換測試數據時記得關閉上一個測試的數據列
#How to use: Select the data you want to test, then press Ctrl+?" to return to the code. Remember to close the previous test data column when switching test data.
input_data = [
    # 該組數據用于測試draw功能
    #This set of data was used to test the draw function.
    # "0 0","0 1","0 2","0 3","0 4","0 5", "0 6","0 7","0 8","0 9",
    # "1 0","1 1","1 2","1 3","1 4","1 5","1 6","1 7","1 8","1 9",
    # "2 0","2 1","2 2","2 3","2 4","2 5","2 6","2 7","2 8","2 9",
    # "3 1","3 0","3 3","3 2","3 5","3 4","3 7","3 6","3 9","3 8",
    # "4 0","4 1","4 2","4 3","4 4","4 5","4 6","4 7","4 8","4 9",
    # "5 0","5 1","5 2","5 3","5 4","5 5","5 6","5 7","5 8","5 9",
    # "6 0","6 1","6 2","6 3","6 4","6 5","6 6","6 7","6 8","6 9",
    # "7 1","7 0","7 3","7 2","7 5","7 4","7 7","7 6","7 9","7 8",
    # "8 0","8 1","8 2","8 3","8 4","8 5","8 6","8 7","8 8","8 9",
    # "9 0","9 1","9 2", "9 3", "9 4","9 5","9 6","9 7","9 8","9 9"

    # ===========================================================
    # 該組數據用于檢測異常輸入 并以橫綫4子結束
    #This set of data is used to detect abnormal input and ends with a hyphen (4 characters).
    # "0 0","9 9","0 1","0 9","0 2","1 3","2 4","0 -1","-1 0","0 100","0999 0","0 9","7 7","0 3"

    # ===========================================================
    # 該組數據將覆蓋部分位置 并最終以X字形結束
    #This set of data will cover partial locations and will eventually end in an X-shape.
#     "4 3","1 0","3 2","0 1","2 1","9 9","4 5","8 0","3 6","0 8","2 7","4 9",
#     "6 3","1 1","7 2","2 2","8 1","6 6","6 5","9 1","7 6","0 0","8 7","5 5",
#     "5 1","5 0","5 2","5 8","5 7","5 6","5 9","0 5","0 3","0 4","9 7","5 5",
#     "1 9",
#     "5 4"
]

for line in input_data:
    pyautogui.typewrite(line)
    pyautogui.press('enter')
    time.sleep(0.01)  
    